#+TITLE: Lab 01: Hello World, Basic I/O and Vectors


* Part 3: Vectors

The program below uses ~std::vector~ to store the sequence
	\[6,\quad 10,\quad 17,\quad 111,\quad 116,\]
then prints out the elements of the vector in order. The output of the program is shown below the code listing.

#+BEGIN_SRC cpp :results output :exports both
#include <iostream>
#include <vector>

int main(){
	std::vector<int> V {};
	
	V.push_back(6);
	V.push_back(10);
	V.push_back(17);
	V.push_back(111);
	V.push_back(116);


	std::cout << "V contains " << V.size() << " elements" << std::endl;
	std::cout << "Contents: ";
	for (auto i: V){
		std::cout << i << " ";
	}
	std::cout << std::endl;

	return 0;
}
#+END_SRC

#+RESULTS:
: V contains 5 elements
: Contents: 6 10 17 111 116

** Vector element access

The program below demonstrates the ~.at()~ method of ~std::vector~, which can be used to access specific elements of the vector by index.
The output of the program appears below the code listing.

#+BEGIN_SRC cpp :results output :exports both
#include <iostream>
#include <vector>

int main(){
	std::vector<int> V {};
	
	V.push_back(6);
	V.push_back(10);
	V.push_back(17);
	V.push_back(111);
	V.push_back(116);


	std::cout << "The first element of V is " << V.at(0) << std::endl;
	std::cout << "The last element of V is " << V.at( V.size() - 1 ) << std::endl;


	return 0;
}
#+END_SRC

#+RESULTS:
: The first element of V is 6
: The last element of V is 116

*Exercise 3*: Add an extra line of output to the end of your solution to Exercise 2: a listing of all elements entered in *reverse order*. You will
probably want to use an indexing ~for~ loop which iterates through indices of the vector in descending order (starting at ~V.size() - 1~).

An example run of a successful solution appears below.
#+BEGIN_EXAMPLE
Enter a number:
6
Enter a number:
10
Enter a number:
17
Enter a number:
asdf
Input was invalid.
Number of Values Entered: 3
Values (forwards): 6 10 17
Values (reverse): 17 10 6
#+END_EXAMPLE

*Extra Practice*: Modify the code which lists elements to separate all elements by commas (but without a comma after the last element), as in the example below.
#+BEGIN_EXAMPLE
Enter a number:
6
Enter a number:
10
Enter a number:
17
Enter a number:
asdf
Input was invalid.
Number of Values Entered: 3
Values (forwards): 6, 10, 17
Values (reverse): 17, 10, 6
#+END_EXAMPLE
